case_packing/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Author: Chen Xiaoxiao                           |
|    \\/     M anipulation  | Website: www.smilemax.top                       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet|outlet|front|back)"
    {
        type            cyclic;
    }

    ground
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    top
    {
        type            prghTotalPressure;
        p0              uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
