case_packing/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default             none;

    div(rhoPhi,U)       bounded Gauss QUICK;

    turbulence          bounded Gauss QUICK;
    div(rhoPhi,k)       $turbulence;
    div(rhoPhi,omega)   $turbulence;
    div(rhoPhi,epsilon) $turbulence;
    div(phi,omega)      $turbulence;
    div(phi,k)          $turbulence;
    div(alphaRhoPhic,k)         $turbulence;
    div(alphaRhoPhic,epsilon)   $turbulence;

    //div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    //div((nuEff*dev2(T(grad(U)))))    Gauss linear;
    div((((alphac*rho)*nuEff)*dev2(T(grad(U))))) Gauss linear;


    div(phi,alpha)                      Gauss vanLeer;
    div(phirb,alpha)                    Gauss linear;
    div(phiGByA,kinematicCloud:alpha)   Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear uncorrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             uncorrected;
}

wallDist
{
    method              meshWave;
}


// ************************************************************************* //
